#include"Xiao.h"

void MainMenu()
{
	cout << "================" << endl;
	cout << "    脑力航迹    " << endl;
	cout << "================" << endl;
	cout << "1.关卡模式" << endl;
	cout << "2.难度模式" << endl;
	cout << "3.无限模式" << endl;
	cout << "4.我的" << endl;
	cout << "5.排行榜" << endl;
	cout << "6.游戏规则" << endl;
	cout << "7.退出游戏" << endl;
	cout << "(输入模式前的数字以进入相应的程序）" << endl;
	cout << "游戏过程中输入10以返回主菜单（进行关卡时除外，具体请见游戏规则）" << endl;
}

void LevelMenu()
{
	cout << "================" << endl;
	cout << "    关卡模式    " << endl;
	cout << "================" << endl;
	cout << "1.关卡一" << endl;
	cout << "2.关卡二" << endl;
	cout << "3.关卡三" << endl;
	cout << "4.关卡四" << endl;
	cout << "5.关卡五" << endl;
	cout << "6.关卡六" << endl;
}

void ruleMenu()
{
	cout << "1.在所有模式中都是输入模式前的数字以进入相应的程序" << endl;
	cout << "2.关卡中A、B为实际轨迹，C为B对A的相对轨迹，目标是求出C轨迹" << endl;
	cout << "3.请注意关卡模式的点不会落在地图边界线上，而难度模式和无限模式则有可能，但绝对不会超出边界线" << endl;
	cout << "4.在答题过程中输入x，y同时为零以重新输入上一个数据(在输入第二个数据时开始生效，如果第一个数据输入（0，0），会进入第二个数据的输入，这时请运用上述规则重新输入C2" << endl;
	cout << "5.关卡模式和难度模式无时间限制，请放心大胆练习!" << endl;
	cout << "6.无限模式存在倒计时，初始为120s，每过一关增加60s，倒计时每10s显示一次，关卡难度增幅随机（在适当范围内），关卡与关卡之间存在5s时间进行休息，最终得分与通关数和关卡难度挂钩" << endl;
	cout << "7.游戏过程中输入10以返回主菜单,但进入关卡之后不管用" << endl;
	cout << "8.关卡模式和难度模式暂未提供退出游戏的途径，你可以通过快速输入数据完成关卡以结束游戏" << endl;
	cout << "9.无限模式可以通过按压‘q’键退出游戏，‘p’键暂停游戏。（不要暂停游戏来做题！）如果通过这种方式退出游戏则不会进行成绩的录入。" << endl;
	//未完待续
}